<?php
// +----------------------------------------------------------------------
// | Tinx 配置文件
// +----------------------------------------------------------------------
// | 作者：Cig   QQ :252560815
// +----------------------------------------------------------------------
// | TinxXss   Blog：404sec.com
// +----------------------------------------------------------------------
// | Author: Cig <cig@404sec.com>
// +----------------------------------------------------------------------
return  array(
//======主要配置项=========
'REGCODE_OPEN'=>'0', //0为不开启邀请码注册
'REGCODE'=>'admin', //邀请码密匙
	
//=========================
//======数据库配置=========

"DB_HOST"=>"localhost" ,   //(主机)

"DB_NAME"=>"xss" ,         //(数据库)

"DB_USER"=>"root",         //(数据库用户名)

"DB_PWD"=>"root" ,         //(数据库密码)

"DB_TYPE"=>"mysql" ,  //(默认Mysql)
"DB_PORT"=>"3306",         //(端口，默认不修改)
"DB_PREFIX"=>'ti_',       //(数据表前戳，默认不修改)
//=========================
//=======邮箱配置(如果支持mail无需支持)==========
'SMTP_SERVER'=>'smtp.163.com',     //邮箱SMTP服务器
'SMTP_PORT'=>25,									//邮箱SMTP  端口
'SMTP_EMAIL'=>  "<xsstestmail@163.com>",         //发信人
'SMTP_USER_MAIL'=>  'xsstestmail@163.com',       //发信邮箱
'SMTP_PASS'=>'testxss',                         //发信邮箱密码
//=========================
//=======次要配置==========
'REG_CODE_INT'=>50,   //邀请码生成次数

//========================
//以下配置为模块配置 ,慎改！！！
'VIEW_PATH'=>'./Theme/',
'DEFAULT_THEME'    =>    'default',
'URL_MODEL'=>1,
'URL_ROUTER_ON'   => true, 
'TMPL_PARSE_STRING'=>array('__PUBLIC__'=>'/Theme/default/Public/'), 
);

?>