<?php
// +----------------------------------------------------------------------
// | Tinx-XSS
// +----------------------------------------------------------------------
// | Xss模块入口
// +----------------------------------------------------------------------
// | QQ：252560815   Blog：404sec.com
// +----------------------------------------------------------------------

define('BIND_MODULE', 'Xss'); // 绑定Home模块到当前入口文件
define('BIND_CONTROLLER','Index');
define('APP_PATH','./Tinx/');
define('APP_NAME','Xss');
define('RUNTIME_PATH','./Temp/Xss');
define('APP_DEBUG',true);
require('./Include/ThinkPHP.php');

?>